# SQL ALIŞTIRMALARI 1

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///vbo.db

'Connected: @vbo.db'

In [3]:
%%sql
SELECT * FROM Customers LIMIT 3;

 * sqlite:///vbo.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')]

# 1. Orders tablosunda kaç müşteri oldugunu bulunuz.

In [4]:
%%sql
SELECT * FROM Orders LIMIT 10;

 * sqlite:///vbo.db
Done.

[(10248, 90, 5, '4.07.1996', 3),
 (10249, 81, 6, '5.07.1996', 1),
 (10250, 34, 4, '8.07.1996', 2),
 (10251, 84, 3, '8.07.1996', 1),
 (10252, 76, 4, '9.07.1996', 2),
 (10253, 34, 3, '10.07.1996', 2),
 (10254, 14, 5, '11.07.1996', 2),
 (10255, 68, 9, '12.07.1996', 3),
 (10256, 88, 3, '15.07.1996', 2),
 (10257, 35, 4, '16.07.1996', 3)]

In [5]:
%%sql
SELECT COUNT(CustomerID) FROM Orders;

 * sqlite:///vbo.db
Done.

[(196,)]

## 2. Orders tablosunda kaç tane eşsiz müşteri olduğunu bulunuz.

In [6]:
%%sql
SELECT COUNT(DISTINCT CustomerID) FROM Orders;

 * sqlite:///vbo.db
Done.

[(74,)]

## 3. Customers tablosunda hangi ülkeden kaçar tane müşteri olduğunu bulunuz.

In [ ]:
%%sql
SELECT COUNT(CustomerID), Country FROM Customers GROUP BY Country;

## 4. Müşterilerin ülkesi Brazil ya da USA olanlarını bulunuz.

In [ ]:
%%sql
SELECT * FROM Customers WHERE Country in ('Brazil', 'USA');

## 5. Önce ülkeye sonra şehre göre group by işlemi yapıp bu kırılımda müşteri sayısını bulunuz.

In [ ]:
%%sql
SELECT COUNT(CustomerID), Country, City FROM Customers GROUP BY Country, City;

# SQL ALIŞTIRMALARI II

## 6. Müşterileri adreslerinin herhangi bir yerinde "da" ifadesi geçen tüm adresleri bulunuz.

In [ ]:
%%sql
SELECT * FROM Customers WHERE Address LIKE '%da%' ;

## 7. Germany-Berlin'de yaşayan müşteri/müşterilerin isimleri nelerdir?

In [ ]:
%%sql
SELECT CustomerName FROM Customers WHERE Country = 'Germany' and City = 'Berlin';

## 8. Canada'da yaşayıp isimlerinde "in" ifadesi geçen müşteri/müşterileri bulunuz.

In [ ]:
%%sql
SELECT CustomerName FROM Customers WHERE CustomerName LIKE '%in%' AND Country = 'Canada';

## 9. Fiyatı 40 TL ile 90 TL arasında olan ürünlerin isimleri ve fiyatları nelerdir?

In [ ]:
%%sql
SELECT ProductName, Price FROM Products WHERE Price <= 90 and Price >=40;

## 10. Fiyatı 30 TL'den büyük olan ürünlerin isimlerini, fiyatlarini ve fiyatlarinin karesini bulunuz ve tüm değişkenlerin isimlendirmelerini aşağıdaki şekilde yapınız:

urun ismi, urun_fiyati, ürün_fiyatinin_karesi

In [6]:
%%sql
SELECT ProductName as urun_ismi, Price as urun_fiyati, Price*Price as urun_fiyatinin_karesi 
FROM Products WHERE Price >= 30;

 * sqlite:///vbo.db
Done.

[("Uncle Bob's Organic Dried Pears", 30, 900),
 ('Northwoods Cranberry Sauce', 40, 1600),
 ('Mishi Kobe Niku', 97, 9409),
 ('Ikura', 31, 961),
 ('Queso Manchego La Pastora', 38, 1444),
 ('Genen Shouyu', 43, 1849),
 ('Alice Mutton', 39, 1521),
 ('Carnarvon Tigers', 62, 3844),
 ('Teatime Chocolate Biscuits', 43, 1849),
 ("Sir Rodney's Marmalade", 81, 6561),
 ('Guaraná Fantástica', 43, 1849),
 ('Gumbär Gummibärchen', 31, 961),
 ('Schoggi Schokolade', 43, 1849),
 ('Rössle Sauerkraut', 45, 2025),
 ('Thüringer Rostbratwurst', 123, 15129),
 ('Gorgonzola Telino', 435, 189225),
 ('Mascarpone Fabioli', 32, 1024),
 ('Geitost', 43, 1849),
 ('Côte de Blaye', 263, 69169),
 ('Boston Crab Meat', 43, 1849),
 ('Ipoh Coffee', 46, 2116),
 ('Røgede sild', 43, 1849),
 ('Zaanse koeken', 43, 1849),
 ('Manjimup Dried Apples', 53, 2809),
 ('Perth Pasties', 32, 1024),
 ('Gnocchi di nonna Alice', 38, 1444),
 ('Ravioli Angelo', 43, 1849),
 ('Raclette Courdavault', 55, 3025),
 ('Camembert Pierrot', 34, 1156),
 ("Sirop d'érable", 43, 1849),
 ('Tarte au sucre', 49, 2401),
 ('Vegie-spread', 43, 1849),
 ('Wimmers gute Semmelknödel', 33, 1089),
 ('Louisiana Fiery Hot Pepper Sauce', 43, 1849),
 ('Scottish Longbreads', 45, 2025),
 ('Gudbrandsdalsost', 36, 1296),
 ('Mozzarella di Giovanni', 34, 1156)]

# SQL ALIŞTIRMALARI III

## 11. Products tablosundaki CategoryID’lerin yani kategorilerin isimleri nelerdir?

In [ ]:
%%sql
SELECT * 
FROM Products 
LEFT JOIN Categories on Products.CategoryID = Categories.CategoryID;

## 12. beverages ürün kategorisindeki ürünlerin fiyat ortalaması nedir?

In [ ]:
%%sql
SELECT AVG(Price) 
FROM Products 
LEFT JOIN Categories on Products.CategoryID = categories.CategoryID 
WHERE CategoryName = 'Beverages';

## 13. USA'de yaşayan müşterilerin kazandırdığı toplam kazancı bulunuz.

In [ ]:
%%sql 
SELECT SUM(p.Price) 
FROM Orders o 
LEFT JOIN OrderDetails od on o.OrderID = od.OrderID 
LEFT JOIN Products p on od.ProductID = p.ProductID 
LEFT JOIN Customers cu on o.CustomerID = cu.CustomerID where cu.Country = 'USA';

## 14. Products tablosundaki CategoryID'lerin isimlerini bulunuz ve sonrasında kategori başına ortalama ürün fiyatını gösteriniz.

In [ ]:
%%sql
SELECT AVG(Price), CategoryName 
FROM Products 
LEFT JOIN Categories on Products.CategoryID = Categories.CategoryID 
GROUP BY CategoryName;

## 15. Çalışanları (EmployeeID) isimleri ile birlikte yaptıkları toplam satışlara göre sıralayınız.

In [ ]:
%%sql
SELECT em.FirstName, SUM(p.Price) toplam_satis 
FROM Orders o 
LEFT JOIN OrderDetails od on o.OrderID = od.OrderID 
LEFT JOIN Products p on od.ProductID = p.ProductID 
LEFT JOIN Employees em on o.EmployeeID = em.EmployeeID 
GROUP BY o.EmployeeID 
ORDER BY toplam_satis DESC;

# SQL ALIŞTIRMALARI IV

## 16. Germany'dan verilen siparişlerin kategorilerine göre ortalama fiyatları nelerdir?

In [ ]:
%%sql
SELECT ca.CategoryName, AVG(p.Price) 
FROM Orders o 
LEFT JOIN OrderDetails od on o.OrderID = od.OrderID 
LEFT JOIN Products p on od.ProductID = p.ProductID 
LEFT JOIN Categories ca on p.CategoryID = ca.CategoryID 
LEFT JOIN Customers cu on o.CustomerID = cu.CustomerID 
WHERE cu.Country = 'Germany' GROUP BY CategoryName;

## 17. Almanya ya da USA'den verilen siparişlerin kategorilerine göre ortalama fiyatları nelerdir?

In [ ]:
%%sql
SELECT ca.CategoryName, AVG(p.Price) 
FROM Orders o 
LEFT JOIN OrderDetails od on o.OrderID = od.OrderID 
LEFT JOIN Products p on od.ProductID = p.ProductID 
LEFT JOIN Categories ca on p.CategoryID = ca.CategoryID 
LEFT JOIN Customers cu on o.CustomerID = cu.CustomerID 
WHERE cu.Country = 'Germany' OR cu.Country = 'USA' GROUP BY CategoryName;

## 18. Haziran Temmuz Ağustos aylarında verilen siparişlerin ortalama fiyatı nedir?

In [ ]:
%%sql
SELECT AVG(Products.Price) 
FROM Products 
LEFT JOIN OrderDetails on OrderDetails.ProductID = products.ProductID 
LEFT JOIN Orders on OrderDetails.OrderID = Orders.OrderID 
WHERE OrderDate like '%07%' or OrderDate like '%08%' or OrderDate like '%09%';

## 19. Müşterilerin 1997 yılına ait siparişlerinin maksimum miktarlarını bulup müşterilerin isimleri ile birlikte büyükten küçüğe sıralayınız.

In [ ]:
%%sql
SELECT CustomerName, MAX(Price) maks 
FROM Products 
LEFT JOIN OrderDetails on Products.ProductID = OrderDetails.ProductID 
LEFT JOIN Orders on OrderDetails.OrderID = Orders.OrderID 
LEFT JOIN Customers on Customers.CustomerID = Orders.CustomerID 
WHERE OrderDate like '%1997%' 
GROUP BY CustomerName ORDER BY maks DESC;

## 20. Sipariş yılı 1997 olan siparişleri alan çalışanları sipariş alma sayılarına göre sıralayınız.

In [ ]:
%%sql
SELECT COUNT(*) n, em.FirstName 
FROM Orders 
LEFT JOIN Employees em on Orders.EmployeeID = em.EmployeeID 
WHERE OrderDate like '%1997%' 
GROUP BY em.FirstName 
ORDER by n DESC;